iPig/src/InformationRegisters/ЖурналОтъема/ЖурналОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтъема</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозрастПриПодсадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМеста</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОтъема/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура МассаВсегоПриИзменении(Элемент)
	Запись.СреднийВес = Окр(Запись.МассаВсего/Запись.КоличествоОтъемышей,2)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НомерЖивотного") Тогда
		Запись.НомерЖивотного 	= Параметры.НомерЖивотного;
		Запись.НомерОпороса 	= Параметры.НомерОпороса;  
		Запись.ДатаВвода		= Параметры.ДатаВвода;
	КонецЕсли; 
	Если Параметры.Свойство("ФормаОткрыта") Тогда 
		Открытие = Истина; 
	Иначе
		Открытие = Ложь;
	КонецЕсли;

	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам); 
		Если ВыбСтрокаМеню <> Неопределено Тогда 
			Реквизиты = ВыбСтрокаМеню.Значение;
			Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
			Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтъемаПриИзменении(Элемент)
	Запись.Период = НачалоДня(Запись.Период);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Открытие = Истина Тогда 
		Записать(); 
		_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
		Закрыть();    
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры
//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	//Отбор = Новый Структура("НомерЖивотного",Запись.НомерЖивотного);
//	//НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СрезПоследних(Дата(Запись.Период),Отбор);
//	НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
//	НаборЗаписей.Прочитать();
//	Если НаборЗаписей.Количество() = 0 Тогда
//		НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
//		НоваяСтрока.Период = ТекущаяДата();
//		НоваяСтрока.НомерЖивотного = Запись.НомерЖивотного;
//		НоваяСтрока.ДатаОтъема = Запись.Период;
//		НоваяСтрока.МачехаОтъем = Запись.Мачеха;
//		НоваяСтрока.КоличествоОтъемышей = Запись.КоличествоОтъемышей;
//		НоваяСтрока.МассаВсего = Запись.МассаВсего;
//		НоваяСтрока.СреднийВес = Запись.СреднийВес;
//		НоваяСтрока.Записать();	
//	Иначе
//		Для Каждого СтрНаборЗаписей из НаборЗаписей Цикл
//			СтрНаборЗаписей.НомерЖивотного = Запись.НомерЖивотного;
//			СтрНаборЗаписей.ДатаОтъема = Запись.Период;
//			СтрНаборЗаписей.МачехаОтъем = Запись.Мачеха;
//			СтрНаборЗаписей.КоличествоОтъемышей = Запись.КоличествоОтъемышей;
//			СтрНаборЗаписей.МассаВсего = Запись.МассаВсего;
//			СтрНаборЗаписей.СреднийВес = Запись.СреднийВес;
//		КонецЦикла;
//		НаборЗаписей.Записать();		
//	КонецЕсли;
//КонецПроцедуры
